Revit 2024 API
ResourceNotFoundException Class
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class ResourceNotFoundException : ApplicationException
Visual Basic
<SerializableAttribute> _
Public Class ResourceNotFoundException _
	Inherits ApplicationException
Visual C++
[SerializableAttribute]
public ref class ResourceNotFoundException : public ApplicationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ResourceNotFoundException
See Also
ResourceNotFoundException Members
Autodesk.Revit.Exceptions Namespace